[Survived] MethodCallRemoval
AzureBlobStorageAdapter.php:74:9
         string $url = null,
         string $prefix = ''
     ) {
-        parent::__construct($client, $container, $prefix);
+        
         $this->client = $client;
         $this->container = $container;

[Killed] LogicalAnd
AzureBlobStorageAdapter.php:77:9
         parent::__construct($client, $container, $prefix);
         $this->client = $client;
         $this->container = $container;
-        if ($url && !filter_var($url, FILTER_VALIDATE_URL)) {
+        if ($url || !filter_var($url, FILTER_VALIDATE_URL)) {
             throw new InvalidCustomUrl();
         }
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ⨯ it sets up the config correctly

   PHPUnit\Framework\ExceptionWrapper

[Killed] LogicalNot
AzureBlobStorageAdapter.php:77:9
         parent::__construct($client, $container, $prefix);
         $this->client = $client;
         $this->container = $container;
-        if ($url && !filter_var($url, FILTER_VALIDATE_URL)) {
+        if ($url && filter_var($url, FILTER_VALIDATE_URL)) {
             throw new InvalidCustomUrl();
         }
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ⨯ it can set a custom URL to override the endpoint

   PHPUnit\Framework\ExceptionWrapper

[Killed] Throw_
AzureBlobStorageAdapter.php:78:13
         $this->client = $client;
         $this->container = $container;
         if ($url && !filter_var($url, FILTER_VALIDATE_URL)) {
-            throw new InvalidCustomUrl();
+            new InvalidCustomUrl();
         }
         $this->url = $url;
statusReason: FAIL  Tests\Unit\AzureBlobStorageAdapterTest
  ✓ it correctly generates the file URL
  ✓ it supports the URL method
  ✓ it supports preceding slash
  ✓ it supports custom URL
  ✓ it supports custom URL with root container
  ✓ it supports temporary URL
  ⨯ it handles invalid custom URL

[Killed] PublicVisibility
AzureBlobStorageAdapter.php:92:5
      *
      * @return string
      */
-    public function getUrl(string $path)
+    protected function getUrl(string $path)
     {
         if ($this->url) {
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ⨯ it handles custom blob endpoints

   PHPUnit\Framework\ExceptionWrapper 

  Call to protected method Matthewbdaly\LaravelAzureStorage\AzureBlobStorageAdapter::getUrl() from scope Illuminate\Filesystem\FilesystemAdapter

[Killed] Ternary
AzureBlobStorageAdapter.php:95:13
     public function getUrl(string $path)
     {
         if ($this->url) {
-            return rtrim($this->url, '/') . '/' . ($this->container === '$root' ? '' : $this->container . '/') . ($this->prefix ? $this->prefix . '/' : '') . ltrim($path, '/');
+            return rtrim($this->url, '/') . '/' . ($this->container === '$root' ? $this->container . '/' : '') . ($this->prefix ? $this->prefix . '/' : '') . ltrim($path, '/');
         }
         return $this->client->getBlobUrl($this->container, $path);
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ⨯ it can set a custom URL to override the endpoint

  Failed asserting that two strings are equal.

[Killed] ConcatOperandRemoval
AzureBlobStorageAdapter.php:95:13
     public function getUrl(string $path)
     {
         if ($this->url) {
-            return rtrim($this->url, '/') . '/' . ($this->container === '$root' ? '' : $this->container . '/') . ($this->prefix ? $this->prefix . '/' : '') . ltrim($path, '/');
+            return rtrim($this->url, '/') . '/' . ($this->container === '$root' ? '' : $this->container . '/') . ($this->prefix ? $this->prefix : '') . ltrim($path, '/');
         }
         return $this->client->getBlobUrl($this->container, $path);
statusReason: PASS  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ✓ it can set a custom URL to override the endpoint
  ✓ it resolves the Azure client
  ✓ it sets up the retry middleware

[Killed] PublicVisibility
AzureBlobStorageAdapter.php:109:5
      *
      * @return string
      */
-    public function getTemporaryUrl(string $path, $ttl, array $options = [])
+    protected function getTemporaryUrl(string $path, $ttl, array $options = [])
     {
         $resourceName = (empty($path) ? $this->container : $this->container  . '/' . $path);
statusReason: FAIL  Tests\Unit\AzureBlobStorageAdapterTest
  ✓ it correctly generates the file URL
  ✓ it supports the URL method
  ✓ it supports preceding slash
  ✓ it supports custom URL
  ✓ it supports custom URL with root container
  ⨯ it supports temporary URL

[Survived] ConcatOperandRemoval
AzureBlobStorageAdapter.php:111:9
      */
     public function getTemporaryUrl(string $path, $ttl, array $options = [])
     {
-        $resourceName = (empty($path) ? $this->container : $this->container  . '/' . $path);
+        $resourceName = empty($path) ? $this->container : '/' . $path;
         if (!$this->key) {
             throw new KeyNotSet();

[Survived] Ternary
AzureBlobStorageAdapter.php:111:9
      */
     public function getTemporaryUrl(string $path, $ttl, array $options = [])
     {
-        $resourceName = (empty($path) ? $this->container : $this->container  . '/' . $path);
+        $resourceName = empty($path) ? $this->container . '/' . $path : $this->container;
         if (!$this->key) {
             throw new KeyNotSet();

[Killed] LogicalNot
AzureBlobStorageAdapter.php:112:9
     public function getTemporaryUrl(string $path, $ttl, array $options = [])
     {
         $resourceName = (empty($path) ? $this->container : $this->container  . '/' . $path);
-        if (!$this->key) {
+        if ($this->key) {
             throw new KeyNotSet();
         }
statusReason: FAIL  Tests\Unit\AzureBlobStorageAdapterTest
  ✓ it correctly generates the file URL
  ✓ it supports the URL method
  ✓ it supports preceding slash
  ✓ it supports custom URL
  ✓ it supports custom URL with root container
  ⨯ it supports temporary URL

[NoCoverage] Throw_
AzureBlobStorageAdapter.php:113:13
     {
         $resourceName = (empty($path) ? $this->container : $this->container  . '/' . $path);
         if (!$this->key) {
-            throw new KeyNotSet();
+            new KeyNotSet();
         }
         $sas = new BlobSharedAccessSignatureHelper($this->client->getAccountName(), $this->key);

[Killed] FunctionCall
AzureBlobStorageAdapter.php:132:9
             (string)Arr::get($options, 'content_type', '')
         );
 
-        return sprintf('%s?%s', $this->getUrl($path), $sasString);
+        sprintf('%s?%s', $this->getUrl($path), $sasString);
+        return null;
     }
 }
statusReason: FAIL  Tests\Unit\AzureBlobStorageAdapterTest
  ✓ it correctly generates the file URL
  ✓ it supports the URL method
  ✓ it supports preceding slash
  ✓ it supports custom URL
  ✓ it supports custom URL with root container
  ⨯ it supports temporary URL
