[Killed] PublicVisibility
AzureStorageServiceProvider.php:44:5
      *
      * @return void
      */
-    public function boot()
+    protected function boot()
     {
         Storage::extend('azure', function (Container $app, array $config) {
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ⨯ it sets up the storage correctly

   PHPUnit\Framework\ExceptionWrapper 

  Call to protected method Matthewbdaly\LaravelAzureStorage\AzureStorageServiceProvider::boot() from scope Illuminate\Container\BoundMethod

[Killed] MethodCallRemoval
AzureStorageServiceProvider.php:46:9
      */
     public function boot()
     {
-        Storage::extend('azure', function (Container $app, array $config) {
-            $client = $app->make(BlobRestProxy::class, $config);
-            assert($client instanceof BlobRestProxy);
-            $adapter = new AzureBlobStorageAdapter(
-                $client,
-                (string)$config['container'],
-                isset($config['key']) ? (string)$config['key'] : null,
-                isset($config['url']) ? (string)$config['url'] : null,
-                isset($config['prefix']) ? (string)$config['prefix'] : '',
-            );
-
-            return new FilesystemAdapter(
-                new Filesystem($adapter, $config),
-                $adapter,
-                $config
-            );
-        });
+        
     }
 
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ⨯ it sets up the config correctly

   PHPUnit\Framework\ExceptionWrapper 

  Driver [azure] is not supported.

[Killed] InstanceOf_
AzureStorageServiceProvider.php:48:13
     {
         Storage::extend('azure', function (Container $app, array $config) {
             $client = $app->make(BlobRestProxy::class, $config);
-            assert($client instanceof BlobRestProxy);
+            assert(false);
             $adapter = new AzureBlobStorageAdapter(
                 $client,
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ⨯ it sets up the config correctly

  assert(false) in /Users/matthewdaly/Projects/laravel-azure-storage/src/AzureStorageServiceProvider.php:46

[Survived] InstanceOf_
AzureStorageServiceProvider.php:48:13
     {
         Storage::extend('azure', function (Container $app, array $config) {
             $client = $app->make(BlobRestProxy::class, $config);
-            assert($client instanceof BlobRestProxy);
+            assert(true);
             $adapter = new AzureBlobStorageAdapter(
                 $client,

[Killed] InstanceOf_
AzureStorageServiceProvider.php:74:13
     {
         $this->app->bind(BlobRestProxy::class, function (Container $app, array $config) {
             $configObject = $app->make('config');
-            assert($configObject instanceof \Illuminate\Contracts\Config\Repository);
+            assert(false);
             $config = empty($config) ? (array)$configObject->get('filesystems.disks.azure') : $config;
             /**
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ⨯ it sets up the config correctly

  assert(false) in /Users/matthewdaly/Projects/laravel-azure-storage/src/AzureStorageServiceProvider.php:60

[Survived] InstanceOf_
AzureStorageServiceProvider.php:74:13
     {
         $this->app->bind(BlobRestProxy::class, function (Container $app, array $config) {
             $configObject = $app->make('config');
-            assert($configObject instanceof \Illuminate\Contracts\Config\Repository);
+            assert(true);
             $config = empty($config) ? (array)$configObject->get('filesystems.disks.azure') : $config;
             /**

[Killed] Ternary
AzureStorageServiceProvider.php:75:13
         $this->app->bind(BlobRestProxy::class, function (Container $app, array $config) {
             $configObject = $app->make('config');
             assert($configObject instanceof \Illuminate\Contracts\Config\Repository);
-            $config = empty($config) ? (array)$configObject->get('filesystems.disks.azure') : $config;
+            $config = empty($config) ? $config : (array) $configObject->get('filesystems.disks.azure');
             /**
              * Provider config
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ✓ it can set a custom URL to override the endpoint
  ✓ it resolves the Azure client
  ⨯ it sets up the retry middleware

[Killed] LogicalNot
AzureStorageServiceProvider.php:82:13
              * @var ProviderConfig $config
              */
 
-            if (!empty($config['connection_string'])) {
+            if (empty($config['connection_string'])) {
                 $endpoint = (string)$config['connection_string'];
             } else {
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ⨯ it sets up the config correctly

   PHPUnit\Framework\ExceptionWrapper 

  Undefined array key "connection_string"

[NoCoverage] CastString
AzureStorageServiceProvider.php:83:17
              */
 
             if (!empty($config['connection_string'])) {
-                $endpoint = (string)$config['connection_string'];
+                $endpoint = $config['connection_string'];
             } else {
                 $endpoint = $this->createConnectionString($config);

[Killed] LogicalOr
AzureStorageServiceProvider.php:92:17
             $retry = data_get($config, 'retry');
             if (isset($retry)) {
                 assert(is_array($retry));
-                assert(is_null($retry['tries']) || is_int($retry['tries']));
+                assert(is_null($retry['tries']) && is_int($retry['tries']));
                 assert(is_null($retry['interval']) || is_int($retry['interval']));
                 assert(is_null($retry['increase']) || is_string($retry['increase']));
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ✓ it can set a custom URL to override the endpoint
  ✓ it resolves the Azure client
  ⨯ it sets up the retry middleware

[Killed] LogicalOr
AzureStorageServiceProvider.php:93:17
             if (isset($retry)) {
                 assert(is_array($retry));
                 assert(is_null($retry['tries']) || is_int($retry['tries']));
-                assert(is_null($retry['interval']) || is_int($retry['interval']));
+                assert(is_null($retry['interval']) && is_int($retry['interval']));
                 assert(is_null($retry['increase']) || is_string($retry['increase']));
                 $blobOptions = [
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ✓ it can set a custom URL to override the endpoint
  ✓ it resolves the Azure client
  ⨯ it sets up the retry middleware

[Killed] LogicalOr
AzureStorageServiceProvider.php:94:17
                 assert(is_array($retry));
                 assert(is_null($retry['tries']) || is_int($retry['tries']));
                 assert(is_null($retry['interval']) || is_int($retry['interval']));
-                assert(is_null($retry['increase']) || is_string($retry['increase']));
+                assert(is_null($retry['increase']) && is_string($retry['increase']));
                 $blobOptions = [
                     'middlewares' => [
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ✓ it handles custom blob endpoints
  ✓ it can set a custom URL to override the endpoint
  ✓ it resolves the Azure client
  ⨯ it sets up the retry middleware

[Survived] ArrayItemRemoval
AzureStorageServiceProvider.php:95:17
                 assert(is_null($retry['tries']) || is_int($retry['tries']));
                 assert(is_null($retry['interval']) || is_int($retry['interval']));
                 assert(is_null($retry['increase']) || is_string($retry['increase']));
-                $blobOptions = [
-                    'middlewares' => [
-                        $this->createRetryMiddleware($retry),
-                    ],
-                ];
+                $blobOptions = [];
             }
 

[NoCoverage] LogicalNot
AzureStorageServiceProvider.php:134:13
     private function createConnectionString(array $config): string
     {
         if (isset($config['sasToken'])) {
-            if (!isset($config['endpoint'])) {
+            if (isset($config['endpoint'])) {
                 throw new EndpointNotSet("Endpoint not set when using sasToken");
             }

[NoCoverage] Throw_
AzureStorageServiceProvider.php:135:17
     {
         if (isset($config['sasToken'])) {
             if (!isset($config['endpoint'])) {
-                throw new EndpointNotSet("Endpoint not set when using sasToken");
+                new EndpointNotSet("Endpoint not set when using sasToken");
             }
             return sprintf(

[Killed] LogicalNot
AzureStorageServiceProvider.php:143:9
                 $config['sasToken']
             );
         }
-        if (!isset($config['key'])) {
+        if (isset($config['key'])) {
             throw new KeyNotSet();
         }
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ⨯ it sets up the config correctly

   PHPUnit\Framework\ExceptionWrapper

[NoCoverage] Throw_
AzureStorageServiceProvider.php:144:13
             );
         }
         if (!isset($config['key'])) {
-            throw new KeyNotSet();
+            new KeyNotSet();
         }
         $endpoint = sprintf(

[Killed] Assignment
AzureStorageServiceProvider.php:152:13
             $config['key']
         );
         if (isset($config['endpoint'])) {
-            $endpoint .= sprintf("BlobEndpoint=%s;", $config['endpoint']);
+            $endpoint = sprintf("BlobEndpoint=%s;", $config['endpoint']);
         }
 
statusReason: FAIL  Tests\Unit\ServiceProviderTest
  ✓ it sets up the storage correctly
  ✓ it sets up the config correctly
  ⨯ it handles custom blob endpoints

   PHPUnit\Framework\ExceptionWrapper 

  The provided connection string 'BlobEndpoint=http://custom;' does not have complete configuration settings.
